In [4]:
import sqlite3 as sql
import pandas as pd
import glob as glob
import os
import zipfile

In [5]:
# dest_folder = '\\Databases'

In [6]:
db_name = "dvdrental.db"

In [62]:
origin = "csv_zip.zip"

In [63]:
#with sql.connect(os.path.join(dest_folder, db_name)) as conn:
with sql.connect(db_name) as conn:
    # df_dict = {}
    with zipfile.ZipFile(origin) as z:
        for file_name in z.namelist():
            if file_name.endswith('.csv'):
                table = os.path.splitext(file_name)[0]
                with z.open(file_name) as f:
                    df = pd.read_csv(f)
                    df.to_sql(table, conn, if_exists='replace', index=False)
                    # df_dict[os.path.splitext(file_name)[0]] = pd.read_csv(f)
                    print(f'Loaded {file_name} into table {table}')

Loaded country.csv into table country
Loaded film_category.csv into table film_category
Loaded store.csv into table store
Loaded staff.csv into table staff
Loaded film.csv into table film
Loaded city.csv into table city
Loaded address.csv into table address
Loaded customer.csv into table customer
Loaded inventory.csv into table inventory
Loaded category.csv into table category
Loaded actor.csv into table actor
Loaded language.csv into table language
Loaded film_actor.csv into table film_actor
Loaded rental.csv into table rental

In [66]:
# db = os.path.join(dest_folder, db_name)

In [18]:
with sql.connect(db_name) as conn:
    cursor = conn.cursor()
    cursor.execute("SELECT name FROM sqlite_master WHERE type = 'table';")
    tables = cursor.fetchall()

    print("Tables in db:")

    for table in tables:
        print("-", table[0])

Tables in db:
- country
- film_category
- store
- staff
- film
- city
- address
- customer
- inventory
- category
- actor
- language
- film_actor
- rental

In [61]:
def query_func(dbase, query:"str", params=None):
    try:
        with sql.connect(dbase) as conn:
            cursor = conn.cursor()
            cursor.execute(query, params or ())

            query_type = query.strip().split()[0].upper()
            print(f"Running a {query_type} query...")
    
            # Define behavior for SELECT queries
            if query.strip().upper().startswith("SELECT"):
    
                # Get column names
                columns = [desc[0] for desc in cursor.description]
        
                # Fetch data
                data = cursor.fetchall()
        
                # Return DataFrame        
                return pd.DataFrame(data, columns=columns)
            else:
                conn.commit()
                return cursor.rowcount
 
    except sql.OperationalError as e:
        print(f"Operational Error: {e}")
    except sql.DatabaseError as e:
        print(f"Database Error: {e}")
    except Exception as e:
        print(f"Unexpected Error: {e}")

In [62]:
df = query_func(db_name, 
            "SELECT * FROM country LIMIT 5;"
           
          )

df.head()

Running a SELECT query...

   country_id         country          last_update
0           1     Afghanistan  2006-02-15 09:44:00
1           2         Algeria  2006-02-15 09:44:00
2           3  American Samoa  2006-02-15 09:44:00
3           4          Angola  2006-02-15 09:44:00
4           5        Anguilla  2006-02-15 09:44:00

In [33]:
tables_clean = []
for table in tables:
    tables_clean.append(table[0])

tables_clean

['country',
 'film_category',
 'store',
 'staff',
 'film',
 'city',
 'address',
 'customer',
 'inventory',
 'category',
 'actor',
 'language',
 'film_actor',
 'rental']

In [63]:
df_dict = {}

for table in tables_clean:
    df_dict[table] = query_func(db_name, f"SELECT * FROM {table} LIMIT 5;")
    print(f"{table} was successfully added to df_dict")

Running a SELECT query...
country was successfully added to df_dict
Running a SELECT query...
film_category was successfully added to df_dict
Running a SELECT query...
store was successfully added to df_dict
Running a SELECT query...
staff was successfully added to df_dict
Running a SELECT query...
film was successfully added to df_dict
Running a SELECT query...
city was successfully added to df_dict
Running a SELECT query...
address was successfully added to df_dict
Running a SELECT query...
customer was successfully added to df_dict
Running a SELECT query...
inventory was successfully added to df_dict
Running a SELECT query...
category was successfully added to df_dict
Running a SELECT query...
actor was successfully added to df_dict
Running a SELECT query...
language was successfully added to df_dict
Running a SELECT query...
film_actor was successfully added to df_dict
Running a SELECT query...
rental was successfully added to df_dict

In [37]:
df_dict.keys()

dict_keys(['country', 'film_category', 'store', 'staff', 'film', 'city', 'address', 'customer', 'inventory', 'category', 'actor', 'language', 'film_actor', 'rental'])

In [46]:
for key in df_dict:
    print(key, ":\n\n", df_dict[key].head(), "\n\n")

country :

    country_id         country          last_update
0           1     Afghanistan  2006-02-15 09:44:00
1           2         Algeria  2006-02-15 09:44:00
2           3  American Samoa  2006-02-15 09:44:00
3           4          Angola  2006-02-15 09:44:00
4           5        Anguilla  2006-02-15 09:44:00


film_category :

    film_id  category_id          last_update
0        1            6  2006-02-15 10:07:09
1        2           11  2006-02-15 10:07:09
2        3            6  2006-02-15 10:07:09
3        4           11  2006-02-15 10:07:09
4        5            8  2006-02-15 10:07:09


store :

    store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2006-02-15 09:57:12
1         2                 2           2  2006-02-15 09:57:12


staff :

    staff_id first_name last_name  address_id                         email  \
0         1       Mike   Hillyer           3  Mike.Hillyer@sakilastaff.com
1         2        Jon  Stephens           4  Jon.Stephens@sakilastaff.com

   store_id  active username                                  password  \
0         1       1     Mike  8cb2237d0679ca88db6464eac60da96345513964
1         2       1      Jon  8cb2237d0679ca88db6464eac60da96345513964

                 last_update      picture
0  2006-05-16 16:13:11.79328  binary data
1  2006-05-16 16:13:11.79328         None


film :

    film_id              title  \
0      133    Chamber Italian
1      384   Grosse Wonderful
2        8    Airport Pollock
3       98  Bright Encounters
4        1   Academy Dinosaur

                                         description  release_year  \
0  A Fateful Reflection of a Moose And a Husband ...          2006
1  A Epic Drama of a Cat And a Explorer who must ...          2006
2  A Epic Tale of a Moose And a Girl who must Con...          2006
3  A Fateful Yarn of a Lumberjack And a Feminist ...          2006
4  A Epic Drama of a Feminist And a Mad Scientist...          2006

   language_id  rental_duration  rental_rate  length  replacement_cost rating  \
0            1                7         4.99     117             14.99  NC-17
1            1                5         4.99      49             19.99      R
2            1                6         4.99      54             15.99      R
3            1                4         4.99      73             12.99  PG-13
4            1                6         0.99      86             20.99     PG

               last_update                        special_features  \
0  2013-05-26 14:50:58.951                              {Trailers}
1  2013-05-26 14:50:58.951                   {"Behind the Scenes"}
2  2013-05-26 14:50:58.951                              {Trailers}
3  2013-05-26 14:50:58.951                              {Trailers}
4  2013-05-26 14:50:58.951  {"Deleted Scenes","Behind the Scenes"}

                                            fulltext
0  'chamber':1 'fate':4 'husband':11 'italian':2 ...
1  'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2  'airport':1 'ancient':18 'confront':14 'epic':...
3  'boat':20 'bright':1 'conquer':14 'encount':2 ...
4  'academi':1 'battl':15 'canadian':20 'dinosaur...


city :

    city_id                city  country_id          last_update
0        1  A Corua (La Corua)          87  2006-02-15 09:45:25
1        2                Abha          82  2006-02-15 09:45:25
2        3           Abu Dhabi         101  2006-02-15 09:45:25
3        4                Acua          60  2006-02-15 09:45:25
4        5               Adana          97  2006-02-15 09:45:25


address :

    address_id               address address2  district  city_id  postal_code  \
0           1     47 MySakila Drive     None   Alberta      300          NaN
1           2    28 MySQL Boulevard     None       QLD      576          NaN
2           3     23 Workhaven Lane     None   Alberta      300          NaN
3           4  1411 Lillydale Drive     None       QLD      576          NaN
4           5        1913 Hanoi Way     None  Nagasaki      463      35200.0

          phone          last_update
0           NaN  2006-02-15 09:45:30
1           NaN  2006-02-15 09:45:30
2  1.403334e+10  2006-02-15 09:45:30
3  6.172236e+09  2006-02-15 09:45:30
4  2.830338e+10  2006-02-15 09:45:30


customer :

    customer_id  store_id first_name last_name  \
0          524         1      Jared       Ely
1            1         1       Mary     Smith
2            2         1   Patricia   Johnson
3            3         1      Linda  Williams
4            4         2    Barbara     Jones

                                 email  address_id  activebool create_date  \
0         jared.ely@sakilacustomer.org         530           1  2006-02-14
1        mary.smith@sakilacustomer.org           5           1  2006-02-14
2  patricia.johnson@sakilacustomer.org           6           1  2006-02-14
3    linda.williams@sakilacustomer.org           7           1  2006-02-14
4     barbara.jones@sakilacustomer.org           8           1  2006-02-14

               last_update  active
0  2013-05-26 14:49:45.738       1
1  2013-05-26 14:49:45.738       1
2  2013-05-26 14:49:45.738       1
3  2013-05-26 14:49:45.738       1
4  2013-05-26 14:49:45.738       1


inventory :

    inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 10:09:17
1             2        1         1  2006-02-15 10:09:17
2             3        1         1  2006-02-15 10:09:17
3             4        1         1  2006-02-15 10:09:17
4             5        1         2  2006-02-15 10:09:17


category :

    category_id       name          last_update
0            1     Action  2006-02-15 09:46:27
1            2  Animation  2006-02-15 09:46:27
2            3   Children  2006-02-15 09:46:27
3            4   Classics  2006-02-15 09:46:27
4            5     Comedy  2006-02-15 09:46:27


actor :

    actor_id first_name     last_name             last_update
0         1   Penelope       Guiness  2013-05-26 14:47:57.62
1         2       Nick      Wahlberg  2013-05-26 14:47:57.62
2         3         Ed         Chase  2013-05-26 14:47:57.62
3         4   Jennifer         Davis  2013-05-26 14:47:57.62
4         5     Johnny  Lollobrigida  2013-05-26 14:47:57.62


language :

    language_id                  name          last_update
0            1  English               2006-02-15 10:02:19
1            2  Italian               2006-02-15 10:02:19
2            3  Japanese              2006-02-15 10:02:19
3            4  Mandarin              2006-02-15 10:02:19
4            5  French                2006-02-15 10:02:19


film_actor :

    actor_id  film_id          last_update
0         1        1  2006-02-15 10:05:03
1         1       23  2006-02-15 10:05:03
2         1       25  2006-02-15 10:05:03
3         1      106  2006-02-15 10:05:03
4         1      140  2006-02-15 10:05:03


rental :

    rental_id          rental_date  inventory_id  customer_id  \
0          2  2005-05-24 22:54:33          1525          459
1          3  2005-05-24 23:03:39          1711          408
2          4  2005-05-24 23:04:41          2452          333
3          5  2005-05-24 23:05:21          2079          222
4          6  2005-05-24 23:08:07          2792          549

           return_date  staff_id          last_update
0  2005-05-28 19:40:33         1  2006-02-16 02:30:53
1  2005-06-01 22:12:39         1  2006-02-16 02:30:53
2  2005-06-03 01:43:41         2  2006-02-16 02:30:53
3  2005-06-02 04:33:21         1  2006-02-16 02:30:53
4  2005-05-27 01:32:07         1  2006-02-16 02:30:53

In [57]:
df_dict["store"].head()

   store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2006-02-15 09:57:12
1         2                 2           2  2006-02-15 09:57:12